# vstAddRadioMode

## Description
```pascal
PROCEDURE vstAddRadioMode(
				inInitialSetting      : INTEGER;
				inNumButtons          : INTEGER;
				inImageSpecification1 : DYNARRAY[] of CHAR;
				inImageSpecification2 : DYNARRAY[] of CHAR;
				inImageSpecification3 : DYNARRAY[] of CHAR;
				inImageSpecification4 : DYNARRAY[] of CHAR;
				inImageSpecification5 : DYNARRAY[] of CHAR;
				inImageSpecification6 : DYNARRAY[] of CHAR);
```

```python

def vs.vstAddRadioMode(inInitialSetting, inNumButtons, inImageSpecification1, inImageSpecification2, inImageSpecification3, inImageSpecification4, inImageSpecification5, inImageSpecification6):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inInitialSetting|INTEGER||
|inNumButtons|INTEGER||
|inImageSpecification1|DYNARRAY[] of CHAR||
|inImageSpecification2|DYNARRAY[] of CHAR||
|inImageSpecification3|DYNARRAY[] of CHAR||
|inImageSpecification4|DYNARRAY[] of CHAR||
|inImageSpecification5|DYNARRAY[] of CHAR||
|inImageSpecification6|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events